In [4]:
import pandas as pd

# Read the CSV file into a pandas DataFrame
file_path = r'C:\Users\hp sys\Downloads\mall_customers.csv'
df = pd.read_csv(file_path)

In [5]:
df.count()

customer_id       200
gender            200
Age               200
annunal_income    200
spending_score    200
dtype: int64

In [8]:
df.head(5)

   customer_id  gender  Age  annunal_income  spending_score
0            1    Male   19              15              39
1            2    Male   21              15              81
2            3  Female   20              16               6
3            4  Female   23              16              77
4            5  Female   31              17              40

In [9]:
df.describe()

       customer_id         Age  annunal_income  spending_score
count   200.000000  200.000000      200.000000      200.000000
mean    100.500000   38.850000       60.560000       50.200000
std      57.879185   13.969007       26.264721       25.823522
min       1.000000   18.000000       15.000000        1.000000
25%      50.750000   28.750000       41.500000       34.750000
50%     100.500000   36.000000       61.500000       50.000000
75%     150.250000   49.000000       78.000000       73.000000
max     200.000000   70.000000      137.000000       99.000000

In [18]:
# select one column from pandas dataframe 
df['customer_id']

0        1
1        2
2        3
3        4
4        5
      ...
195    196
196    197
197    198
198    199
199    200
Name: customer_id, Length: 200, dtype: int64

In [19]:
# select multiple column from dataframe 

## df['customer_id','Age'] - why it is wrong
df[['customer_id','Age','annunal_income']]

     customer_id  Age  annunal_income
0              1   19              15
1              2   21              15
2              3   20              16
3              4   23              16
4              5   31              17
..           ...  ...             ...
195          196   35             120
196          197   45             126
197          198   32             126
198          199   32             137
199          200   30             137

[200 rows x 3 columns]

In [10]:
# Perform aggregate operations
# For example, let's say you want to find the mean of the 'age' column grouped by 'gender'
mean_age_by_gender = df.groupby('gender')['Age'].mean()
print("\nMean age by gender:")
print(mean_age_by_gender)

Mean age by gender:
gender
Female    38.098214
Male      39.806818
Name: Age, dtype: float64

In [24]:
# You can perform other aggregate operations similarly, for example:
# Total spending_score for each customer
total_spending_by_customer = df.groupby('customer_id')['spending_score'].sum()
print("\nTotal spending score for each customer:")
print(total_spending_by_customer)
type(total_spending_by_customer)

Total spending score for each customer:
customer_id
1      39
2      81
3       6
4      77
5      40
       ..
196    79
197    28
198    74
199    18
200    83
Name: spending_score, Length: 200, dtype: int64

pandas.core.series.Series

## Exception Handling

File is not available
End of execution